testTesults/stage_5/5_range_wrk.txt
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 5383.448ms, rate sampling interval: 19120ms
  Thread calibration: mean lat.: 5443.950ms, rate sampling interval: 16957ms
  Thread calibration: mean lat.: 5279.454ms, rate sampling interval: 16941ms
  Thread calibration: mean lat.: 5249.394ms, rate sampling interval: 17301ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.23s    14.13s    1.00m    58.01%
    Req/Sec     3.88      0.33     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.87s 
 75.000%   47.51s 
 90.000%    0.92m 
 99.000%    0.98m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10010.623     0.000000            1         1.00
   15974.399     0.100000           83         1.11
   20791.295     0.200000          165         1.25
   25608.191     0.300000          248         1.43
   30261.247     0.400000          330         1.67
   34865.151     0.500000          412         2.00
   37552.127     0.550000          454         2.22
   39911.423     0.600000          495         2.50
   42467.327     0.650000          536         2.86
   44990.463     0.700000          579         3.33
   47513.599     0.750000          618         4.00
   48627.711     0.775000          640         4.44
   50102.271     0.800000          660         5.00
   50921.471     0.825000          680         5.71
   52625.407     0.850000          702         6.67
   53346.303     0.875000          722         8.00
   54329.343     0.887500          732         8.89
   55083.007     0.900000          742        10.00
   55508.991     0.912500          753        11.43
   55738.367     0.925000          764        13.33
   56786.943     0.937500          774        16.00
   57114.623     0.943750          778        17.78
   57507.839     0.950000          784        20.00
   57737.215     0.956250          788        22.86
   58032.127     0.962500          794        26.67
   58195.967     0.968750          799        32.00
   58228.735     0.971875          804        35.56
   58228.735     0.975000          804        40.00
   58261.503     0.978125          806        45.71
   58556.415     0.981250          809        53.33
   58687.487     0.984375          812        64.00
   58982.399     0.985938          813        71.11
   59015.167     0.987500          814        80.00
   59047.935     0.989062          816        91.43
   59310.079     0.990625          817       106.67
   59408.383     0.992188          818       128.00
   59473.919     0.992969          820       142.22
   59473.919     0.993750          820       160.00
   59473.919     0.994531          820       182.86
   59637.759     0.995313          821       213.33
   59637.759     0.996094          821       256.00
   59736.063     0.996484          822       284.44
   59736.063     0.996875          822       320.00
   59736.063     0.997266          822       365.71
   59801.599     0.997656          823       426.67
   59801.599     0.998047          823       512.00
   59801.599     0.998242          823       568.89
   59801.599     0.998437          823       640.00
   59801.599     0.998633          823       731.43
   59834.367     0.998828          824       853.33
   59834.367     1.000000          824          inf
#[Mean    =    35234.239, StdDeviation   =    14129.291]
#[Max     =    59801.600, Total count    =          824]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  979 requests in 1.00m, 49.71KB read
Requests/sec:     16.31
Transfer/sec:     848.15B
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 5737.830ms, rate sampling interval: 18268ms
  Thread calibration: mean lat.: 5519.978ms, rate sampling interval: 16474ms
  Thread calibration: mean lat.: 5963.805ms, rate sampling interval: 18497ms
  Thread calibration: mean lat.: 5414.898ms, rate sampling interval: 18317ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.03s    14.51s    1.00m    57.80%
    Req/Sec     1.33      0.67     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.54s 
 75.000%   47.38s 
 90.000%    0.92m 
 99.000%    0.99m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10149.887     0.000000            1         1.00
   15171.583     0.100000           33         1.11
   19349.503     0.200000           66         1.25
   24559.615     0.300000           99         1.43
   29442.047     0.400000          131         1.67
   34537.471     0.500000          164         2.00
   37912.575     0.550000          180         2.22
   40075.263     0.600000          198         2.50
   42598.399     0.650000          213         2.86
   44302.335     0.700000          229         3.33
   47939.583     0.750000          246         4.00
   48988.159     0.775000          254         4.44
   50462.719     0.800000          262         5.00
   51740.671     0.825000          270         5.71
   52985.855     0.850000          278         6.67
   54525.951     0.875000          288         8.00
   54657.023     0.887500          292         8.89
   54984.703     0.900000          295        10.00
   55705.599     0.912500          299        11.43
   56459.263     0.925000          303        13.33
   57376.767     0.937500          307        16.00
   57704.447     0.943750          309        17.78
   58294.271     0.950000          312        20.00
   58589.183     0.956250          313        22.86
   58753.023     0.962500          315        26.67
   59015.167     0.968750          317        32.00
   59113.471     0.971875          318        35.56
   59146.239     0.975000          319        40.00
   59342.847     0.978125          320        45.71
   59375.615     0.981250          321        53.33
   59473.919     0.984375          324        64.00
   59473.919     0.985938          324        71.11
   59473.919     0.987500          324        80.00
   59473.919     0.989062          324        91.43
   59473.919     0.990625          324       106.67
   59670.527     0.992188          325       128.00
   59670.527     0.992969          325       142.22
   59670.527     0.993750          325       160.00
   59834.367     0.994531          327       182.86
   59834.367     1.000000          327          inf
#[Mean    =    35033.702, StdDeviation   =    14506.093]
#[Max     =    59801.600, Total count    =          327]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  390 requests in 1.00m, 14.60MB read
Requests/sec:      6.50
Transfer/sec:    249.06KB
Running 1m test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 5736.064ms, rate sampling interval: 16130ms
  Thread calibration: mean lat.: 4806.004ms, rate sampling interval: 17137ms
  Thread calibration: mean lat.: 4624.752ms, rate sampling interval: 18808ms
  Thread calibration: mean lat.: 5371.688ms, rate sampling interval: 16482ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.62s    14.38s    0.99m    57.97%
    Req/Sec     0.60      0.49     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.67s 
 75.000%   46.33s 
 90.000%    0.90m 
 99.000%    0.99m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10092.543     0.000000            1         1.00
   14409.727     0.100000           21         1.11
   19939.327     0.200000           42         1.25
   24330.239     0.300000           63         1.43
   29835.263     0.400000           83         1.67
   34668.543     0.500000          104         2.00
   37289.983     0.550000          114         2.22
   39649.279     0.600000          125         2.50
   42172.415     0.650000          135         2.86
   45023.231     0.700000          145         3.33
   46333.951     0.750000          156         4.00
   47742.975     0.775000          161         4.44
   49643.519     0.800000          166         5.00
   50888.703     0.825000          171         5.71
   52166.655     0.850000          176         6.67
   53805.055     0.875000          182         8.00
   54067.199     0.887500          187         8.89
   54067.199     0.900000          187        10.00
   54132.735     0.912500          189        11.43
   55607.295     0.925000          193        13.33
   55640.063     0.937500          195        16.00
   56623.103     0.943750          196        17.78
   56885.247     0.950000          197        20.00
   57081.855     0.956250          198        22.86
   57999.359     0.962500          200        26.67
   58294.271     0.968750          201        32.00
   58392.575     0.971875          202        35.56
   58392.575     0.975000          202        40.00
   58884.095     0.978125          203        45.71
   58916.863     0.981250          204        53.33
   58916.863     0.984375          204        64.00
   59342.847     0.985938          205        71.11
   59342.847     0.987500          205        80.00
   59342.847     0.989062          205        91.43
   59408.383     0.990625          206       106.67
   59408.383     0.992188          206       128.00
   59408.383     0.992969          206       142.22
   59408.383     0.993750          206       160.00
   59408.383     0.994531          206       182.86
   59703.295     0.995313          207       213.33
   59703.295     1.000000          207          inf
#[Mean    =    34620.500, StdDeviation   =    14380.304]
#[Max     =    59670.528, Total count    =          207]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  242 requests in 1.00m, 8.97MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:      4.03
Transfer/sec:    152.97KB